Revit 2024 API
MaterialNode.Glossiness Property
 The level of glossiness of the material
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int Glossiness { get; }
Visual Basic
Public ReadOnly Property Glossiness As Integer
	Get
Visual C++
public:
property int Glossiness {
	int get ();
}
See Also
MaterialNode Class
Autodesk.Revit.DB Namespace